// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

Console.Write("Введите число: ");
int num = int.Parse(Console.ReadLine());
int numSum = NumSum(num);
Console.WriteLine(numSum);
int NumSum(int number)
{
    int sum = 0;
    for (int i = number; i > 0; i /= 10)// пришлось немного помучиться с циклом for. Вероятно, я его не докнца понимаю.
    // Опытным путём я пришёл к тому, что в одну строку мы задаём начальное значение переменной i, в т.ч. объявляя сразу её тип,
    // далее мы озвучиваем улсловие "пока i равно/не равно/больше/меньше какого-то значения" и добавляем действие, которое будет выполняться
    // с i каждый раз при выполнении итерации до выхода из цикла. Заранее благодарю за пояснения:)
    {
        sum = sum + i % 10;
    }
    // while (number > 0)
    // {
    //     sum = sum + number % 10;
    //     number = number / 10;
    // }
    return sum;
}
